<?php
require_once('../tools.php');

$datalist = array(
  10079462 => '雑誌・ムック > ムック > 実用',
  10079463 => '雑誌・ムック > ムック > 実用',
  10079464 => '雑誌・ムック > ムック > 実用',
  10079465 => '雑誌・ムック > ムック > 実用',
  10079466 => '雑誌・ムック > ムック > 実用',
  10079467 => '雑誌・ムック > ムック > 実用',
  10079468 => '雑誌・ムック > ムック > 実用',
  10079469 => '雑誌・ムック > ムック > 実用',
  10079470 => '雑誌・ムック > ムック > 実用',
  10079471 => '雑誌・ムック > ムック > 実用',
  10079472 => '雑誌・ムック > ムック > 実用',
  10079473 => '雑誌・ムック > ムック > 実用',
  10079474 => '雑誌・ムック > ムック > 実用',
  10079475 => '雑誌・ムック > ムック > 実用',
  10079476 => '雑誌・ムック > ムック > 実用',
  10079477 => '雑誌・ムック > ムック > 実用',
  10079478 => '雑誌・ムック > ムック > 実用',
  10079479 => '雑誌・ムック > ムック > 実用',
  10079480 => '雑誌・ムック > ムック > 実用',
  10079481 => '雑誌・ムック > ムック > 実用',
  10079482 => '雑誌・ムック > ムック > 実用',
  10079483 => '雑誌・ムック > ムック > 実用',
  10079484 => '雑誌・ムック > ムック > 実用',
  10079485 => '雑誌・ムック > ムック > 実用',
  10079486 => '雑誌・ムック > ムック > 実用',
  10079487 => '雑誌・ムック > ムック > 実用',
  10079488 => '雑誌・ムック > ムック > 実用',
  10079489 => '雑誌・ムック > ムック > 実用',
  10079490 => '雑誌・ムック > ムック > 実用',
  10079491 => '雑誌・ムック > ムック > 実用',
  10079492 => '雑誌・ムック > ムック > 実用',
  10079493 => '雑誌・ムック > ムック > 実用',
  10079494 => '雑誌・ムック > ムック > 実用',
  10079495 => '雑誌・ムック > ムック > 実用',
  10079496 => '雑誌・ムック > ムック > 実用',
  10079497 => '雑誌・ムック > ムック > 実用',
  10079498 => '雑誌・ムック > ムック > 実用',
  10079499 => '雑誌・ムック > ムック > 実用',
  10079500 => '雑誌・ムック > ムック > 実用',
  10079501 => '雑誌・ムック > ムック > 実用',
  10079502 => '雑誌・ムック > ムック > 実用',
  10079503 => '雑誌・ムック > ムック > 実用',
  10079504 => '雑誌・ムック > ムック > 実用',
  10079505 => '雑誌・ムック > ムック > 実用',
  10079506 => '雑誌・ムック > ムック > 実用',
  10079507 => '雑誌・ムック > ムック > 実用',
  10079508 => '雑誌・ムック > ムック > 実用',
  10079509 => '雑誌・ムック > ムック > 実用',
  10079510 => '雑誌・ムック > ムック > 実用',
  10079511 => '雑誌・ムック > ムック > 実用',
  10079512 => '雑誌・ムック > ムック > 実用',
  10079513 => '雑誌・ムック > ムック > 実用',
  10079514 => '雑誌・ムック > ムック > 実用',
  10079515 => '雑誌・ムック > ムック > 実用',
  10079516 => '雑誌・ムック > ムック > 実用',
  10079517 => '雑誌・ムック > ムック > 本愉',
  10079518 => '雑誌・ムック > ムック > 本愉',
  10079519 => '雑誌・ムック > ムック > 本愉',
  10079520 => '雑誌・ムック > ムック > 本愉',
  10079521 => '雑誌・ムック > ムック > 本愉',
  10079522 => '雑誌・ムック > ムック > 本愉',
  10079523 => '雑誌・ムック > ムック > 本愉',
  10079524 => '雑誌・ムック > ムック > 本愉',
  10079525 => '雑誌・ムック > ムック > 本愉',
  10079526 => '雑誌・ムック > ムック > 本愉',
  10079527 => '雑誌・ムック > ムック > 本愉',
  10079528 => '雑誌・ムック > ムック > 本愉',
  10079529 => '雑誌・ムック > ムック > 本愉',
  10079530 => '雑誌・ムック > ムック > 本愉',
  10079531 => '雑誌・ムック > ムック > 本愉',
  10079532 => '雑誌・ムック > ムック > 本愉',
  10079533 => '雑誌・ムック > ムック > 本愉',
  10079534 => '雑誌・ムック > ムック > 演芸',
  10079535 => '雑誌・ムック > ムック > 演芸',
  10079536 => '雑誌・ムック > ムック > 演芸',
  10079537 => '雑誌・ムック > ムック > 演芸',
  10079538 => '雑誌・ムック > ムック > 実用',
  10079539 => '雑誌・ムック > ムック > 実用',
  10079540 => '雑誌・ムック > ムック > 実用',
  10079541 => '雑誌・ムック > ムック > 実用',
  10079542 => 'コミック > バンブーコミックス > ４コマ',
  10079543 => 'コミック > バンブーコミックス > ４コマ',
  10079544 => 'コミック > バンブーコミックス > ４コマ',
  10079545 => 'コミック > バンブーコミックス > ４コマ',
  10079546 => 'コミック > バンブーコミックス > BL',
  10079547 => 'コミック > バンブーコミックス > BL',
  10079548 => 'コミック > バンブーコミックス > BL',
  10079549 => 'コミック > バンブーコミックス > BL',
  10079550 => 'コミック > バンブーコミックス > BL',
  10079551 => 'コミック > バンブーコミックス > BL',
  10079552 => 'コミック > バンブーコミックス > BL',
  10079553 => 'コミック > B6廉価コミックス > 4コマ',
  10079554 => 'コミック > バンブーコミックス > ４コマ',
  10079555 => 'コミック > バンブーコミックス',
  10079556 => 'コミック > バンブーコミックス',
  10079557 => 'コミック > バンブーコミックス',
  10079558 => 'コミック > バンブーコミックス',
  10079559 => 'コミック > バンブーコミックス',
  10079560 => 'コミック > バンブーコミックス',
  10079561 => 'コミック > バンブーコミックス',
  10079562 => 'コミック > バンブーコミックス',
  10079563 => 'コミック > バンブーコミックス',
  10079564 => 'コミック > バンブーコミックス',
  10079565 => 'コミック > バンブーコミックス',
  10079566 => 'コミック > バンブーコミックス',
  10079567 => 'コミック > バンブーコミックス',
  10079568 => 'コミック > バンブーコミックス',
  10079569 => 'コミック > バンブーコミックス',
  10079570 => 'コミック > バンブーコミックス',
  10079571 => 'コミック > バンブーコミックス',
  10079572 => 'コミック > バンブーコミックス',
  10079573 => 'コミック > バンブーコミックス',
  10079574 => 'コミック > 近代麻雀コミックス',
  10079575 => '雑誌・ムック > ムック > 実用',
  10079576 => '雑誌・ムック > ムック > 本愉',
  10079577 => '書籍 > 一般書 > 実用書',
  10079578 => '書籍 > コミックエッセイ',
  10079579 => '書籍 > コミックエッセイ',
  10079580 => '書籍 > コミックエッセイ',
  10079581 => '書籍 > コミックエッセイ',
  10079582 => '書籍 > 一般書 > 書籍扱いコミック（TL）',
  10079583 => '書籍 > 一般書 > 書籍扱いコミック（TL）',
  10079584 => '書籍 > 一般書 > 書籍扱いコミック（TL）',
  10079585 => '書籍 > コミックエッセイ',
  10079586 => '書籍 > コミックエッセイ',
  10079587 => '書籍 > コミックエッセイ',
  10079588 => '文庫 > 国内文芸 > BL・TL',
  10079589 => '書籍 > 一般書 > 日本文芸',
  10079590 => '文庫 > 海外文芸 > ロマンス小説',
  10079591 => '文庫 > 海外文芸 > ロマンス小説',
  10079592 => '文庫 > 海外文芸 > 一般',
  10079593 => '文庫 > 海外文芸 > 一般',
  10079594 => '文庫 > 国内文芸 > BL・TL',
  10079595 => '文庫 > 国内文芸 > BL・TL',
  10079596 => '文庫 > 国内文芸 > BL・TL',
  10079597 => '文庫 > 国内文芸 > BL・TL',
  10079598 => '文庫 > 国内文芸 > 官能',
  10079599 => '文庫 > 国内文芸 > BL・TL',
  10079600 => '文庫 > 国内文芸 > BL・TL',
  10079601 => '文庫 > 国内文芸 > BL・TL',
  10079602 => '文庫 > 国内文芸 > BL・TL',
  10079603 => '文庫 > 国内文芸 > BL・TL',
  10079604 => '文庫 > 国内文芸 > 官能',
  10079605 => '文庫 > 国内文芸 > 官能',
  10079606 => '文庫 > 国内文芸 > 官能',
  10079607 => '文庫 > 国内文芸 > 官能',
  10079608 => '文庫 > 国内文芸 > 官能',
  10079609 => '文庫 > 国内文芸 > 官能',
  10079610 => '文庫 > 国内その他 > 実話怪談',
  10079611 => '文庫 > 国内その他 > 実話怪談',
  10079612 => '文庫 > 国内その他 > 実話怪談',
  10079613 => '文庫 > 国内その他 > 実話怪談',
  10079614 => '文庫 > 国内その他 > 実話怪談',
  10079615 => '文庫 > 国内その他 > 実話怪談',
  10079616 => '文庫 > 国内その他 > 実話怪談',
  10079617 => '文庫 > 国内その他 > 実話怪談',
  10079618 => '文庫 > 国内その他 > 実話怪談',
  10079619 => '書籍 > 写真集 > ヌード | R指定 > R-18作品',
  10079620 => '書籍 > 写真集 > ヌード | R指定 > R-18作品',
  10079621 => '書籍 > 写真集 > ヌード | R指定 > R-18作品',
  10079622 => '雑誌・ムック > ムック > スポーツその他一般',
  10079623 => 'DVD・BDなど > 麻雀',
  10079624 => 'DVD・BDなど > 麻雀',
  10079625 => 'DVD・BDなど > 麻雀',
  10079626 => 'DVD・BDなど > 麻雀',
  10079627 => 'DVD・BDなど > 麻雀',
  10079628 => 'DVD・BDなど > 麻雀',
  10079629 => 'DVD・BDなど > 麻雀',
  10079630 => 'DVD・BDなど > 麻雀',
  10079631 => 'DVD・BDなど > 麻雀',
  10079632 => 'DVD・BDなど > 麻雀',
  10079633 => 'DVD・BDなど > 海外の映画・TVドラマ',
  10079634 => 'DVD・BDなど > 海外の映画・TVドラマ',
  10079635 => 'DVD・BDなど > 海外の映画・TVドラマ',
  10079636 => 'DVD・BDなど > 海外の映画・TVドラマ',
  10079637 => 'DVD・BDなど > ドキュメンタリー他',
  10079638 => 'DVD・BDなど > アイドル・タレント',
  10079639 => 'DVD・BDなど > アイドル・タレント',
  10079640 => 'DVD・BDなど > アイドル・タレント',
  10079641 => 'DVD・BDなど > アイドル・タレント',
  10079642 => 'DVD・BDなど > アイドル・タレント',
  10079643 => 'DVD・BDなど > アイドル・タレント',
  10079644 => 'DVD・BDなど > アイドル・タレント',
  10079645 => 'DVD・BDなど > アイドル・タレント',
  10079646 => 'DVD・BDなど > アイドル・タレント',
  10079647 => 'DVD・BDなど > アイドル・タレント',
  10079648 => 'DVD・BDなど > アイドル・タレント',
  10079649 => 'DVD・BDなど > アイドル・タレント',
  10079650 => 'DVD・BDなど > アイドル・タレント',
  10079651 => 'DVD・BDなど > ヤングアダルト | R指定 > R-18作品',
  10079652 => 'DVD・BDなど > アイドル・タレント',
  10079653 => 'DVD・BDなど > アイドル・タレント',
  10079654 => 'DVD・BDなど > アイドル・タレント',
  10079655 => 'DVD・BDなど > アイドル・タレント',
  10079656 => 'DVD・BDなど > アイドル・タレント',
  10079657 => 'DVD・BDなど > アイドル・タレント',
);

// ！！！！！！！！！！！！！！
// ！！！実行後は bookCountの再計算処理を実行する！！！
// ！！！！！！！！！！！！！！
//
// ジャンル名に ' が入っている場合は考慮できていない(setformatは考慮している)
$publisher_id = 1125; // 竹書房 pro
$debug = true;

if($debug) {
  // Docker用
  // 先に Postgres側を起動しておかないと IPが認識できず、アクセスできない
  $dsn = 'pgsql:dbname=app_development;host=172.20.254.227;port=15432';
  $db = new PDO($dsn, 'postgres', 'password');
  $publisher_id = 1002; // docker

  // // STG用
  // $dsn = 'pgsql:dbname=d32hupuj29g33c;host=ec2-44-206-11-200.compute-1.amazonaws.com;port=5432';
  // $db = new PDO($dsn, 'rszgmnfrbqlgot', '237cbd5e1db3db80228bbf1483cd208c850e4d22bfd12c85b7e317b1cc569700');
} else {
  // 本番用
  $dsn = 'pgsql:dbname=d3uldjpkj3ctch;host=ec2-52-204-191-143.compute-1.amazonaws.com;port=5432';
  $db = new PDO($dsn, 'u79urs9of0un6s', 'p34d02ab02bf28b14e66b09bc464b4b3e75840bfa9418dba10202fbe1840f91ec');
}

$datacount = count($datalist);

ob_start();

$i = 0;
$roop = 0;
foreach ($datalist as $k => $v) {
  // 書誌の存在チェック
  $sql = "select id from books where id = '{$k}' and publisher_id = {$publisher_id};";
  $sth = $db->query($sql);
  $book = $sth->fetch(PDO::FETCH_ASSOC);
  if(empty($book)) {
    // 書誌データがない場合は スキップ
    echo "not book data id {$k}<br>";
    flush();
    ob_flush();
    continue;
  }

  // ジャンル分割
  $genrelist = explode('|',$v);
  foreach ($genrelist as $gk => $gv) {
    $gv = trim($gv);
    // 階層構造 分割
    $gt = explode('>',$gv);
    $depth = count($gt);
    if($depth > 3) {
      // 4階層目以降が設定されているため エラー
      echo "depth error book id {$k}<br>";
      flush();
      ob_flush();
      break;
    }
    $pg = null;
    foreach ($gt as $gtk => $gtv) {
      $gtv = trim($gtv);
      if($gtk == 0) {
        // 1階層 登録確認
        $sql = "select * from genres where publisher_id = {$publisher_id} and name = '{$gtv}';";
      } else {
        // 2階層目以降 登録確認
        $sql = "select * from genres where publisher_id = {$publisher_id} and name = '{$gtv}' and lft > {$pg['lft']} and rgt < {$pg['rgt']};";
      }
      $sth = $db->query($sql);
      $g = $sth->fetch(PDO::FETCH_ASSOC);
      if(empty($g)) {
        // ジャンルの登録が必要
        if($gtk == 0) {
          // 1階層 登録

          // 最大のrgt値取得
          $sql2 = "select max(rgt) from genres where publisher_id = {$publisher_id}";
          $sth = $db->query($sql2);
          $r = $sth->fetch(PDO::FETCH_ASSOC);
          $maxlft = 0;
          if ( !empty($r) && !empty($r['max'])) {
            $maxlft = $r['max'];
          }
          $name_search = tools::convertSearchText($gtv);
          $isql = "insert into genres (name,publisher_id,lft,rgt,depth,created_at,updated_at,name_search) values ('{$gtv}',{$publisher_id}," . ($maxlft + 1) . "," . ($maxlft + 2) . ",{$gtk},now(),now(),'{$name_search}');";
        } else {
          // 2階層目以降 登録

          // 既存のジャンルのlftとrgtを調整して
          // 追加するスペースを用意する
          $isql = "update genres set lft = lft+2 where publisher_id = {$publisher_id} and lft >= {$pg['rgt']};";
          if($db->exec($isql) === false) {
            echo "lft change error book id {$k}<br>";
            flush();
            ob_flush();
            break 2;
          }
          $isql = "update genres set rgt = rgt+2 where publisher_id = {$publisher_id} and rgt >= {$pg['rgt']};";
          if($db->exec($isql) === false) {
            echo "rgt change error book id {$k}<br>";
            flush();
            ob_flush();
            break 2;
          }

          $name_search = tools::convertSearchText($gtv);
          $isql = "insert into genres (name,publisher_id,parent_id,lft,rgt,depth,created_at,updated_at,name_search) values ('{$gtv}',{$publisher_id},{$pg['id']},{$pg['rgt']}," . ($pg['rgt'] + 1) . ",{$gtk},now(),now(),'{$name_search}');";
        }
        if($db->exec($isql) === false) {
          echo "not insert genre skip book id {$k}<br>";
          flush();
          ob_flush();
          break 2;
        }
        // 再取得
        if($gtk != 0) {
          // lft,rgt値が変わっているため、親から再取得
          $sql2 = "select * from genres where publisher_id = {$publisher_id} and id = '{$pg['id']}';";
          $sth = $db->query($sql2);
          $pg = $sth->fetch(PDO::FETCH_ASSOC);
          if(empty($pg)) {
            echo "not get parent genre skip book id {$k}<br>";
            flush();
            ob_flush();
            break 2;
          }
          $sql = "select * from genres where publisher_id = {$publisher_id} and name = '{$gtv}' and lft > {$pg['lft']} and rgt < {$pg['rgt']};";
        }
        $sth = $db->query($sql);
        $g = $sth->fetch(PDO::FETCH_ASSOC);
        if(empty($g)) {
          echo "not get insert genre skip book id {$k}<br>";
          flush();
          ob_flush();
          break 2;
        }
      }
      // 親ジャンルとして退避
      $pg = $g;
      if(($gtk + 1) == count($gt)) {
        // 中間テーブルへ レコード追加

        // 既に レコードがないかチェックする
        $sql = "select * from book_genres where book_id = {$book['id']} and genre_id = {$g['id']}";
        $sth = $db->query($sql);
        $bg = $sth->fetch(PDO::FETCH_ASSOC);
        if(!empty($bg)) {
          // 既にレコードがある場合は スキップ
          echo "book_genre exists id {$k}<br>";
          flush();
          ob_flush();
          continue;
        }

        $isql = "insert into book_genres (book_id,genre_id,created_at,updated_at) values ({$book['id']},{$g['id']},now(),now());";
        if($db->exec($isql) === false) {
          echo "not set book_genre skip book id {$k}<br>";
          flush();
          ob_flush();
          break 2;
        }
      }
    }
  }

  $i++;
  $roop++;
  // if($i > 20) {
    // 20回まわったら ページ出力
    echo $roop . " / " . $datacount . " id:" . $k . "<br>";
    flush();
    ob_flush();
    $i = 0;
  // }
}
flush();
ob_flush();

ob_end_flush();

echo "end!!";
exit();
