<?php

$list = array(
  array('name' => 'スーパージャーナル　クラシックＢＥＳＴ','isbn' => '9784812449974'),
  array('name' => 'まるごと１冊ぼのぼのスペシャル','isbn' => '9784801903746'),
  array('name' => 'フリテンくんＰＲＥＭＩＵＭ','isbn' => '9784801906006'),
  array('name' => 'フリテンくんＧＯＬＤ','isbn' => '9784801908215'),
  array('name' => '劇漫デラックス','isbn' => '9784801906044'),
  array('name' => '劇漫デラックス　','isbn' => '9784801907409'),
  array('name' => '劇漫デラックス　','isbn' => '9784801908109'),
  array('name' => '劇漫デラックス','isbn' => '9784801908802'),
  array('name' => '劇漫デラックス　','isbn' => '9784801909861'),
  array('name' => '劇漫デラックス　','isbn' => '9784801910508'),
  array('name' => '劇漫デラックス　','isbn' => '9784801911413'),
  array('name' => '劇漫デラックス　','isbn' => '9784801912649'),
  array('name' => '劇漫デラックス　','isbn' => '9784801913684'),
  array('name' => '劇漫デラックス　','isbn' => '9784801914599'),
  array('name' => '劇漫デラックス　','isbn' => '9784801915572'),
  array('name' => '劇漫デラックス　','isbn' => '9784801916593'),
  array('name' => '劇漫デラックス　','isbn' => '9784801917590'),
  array('name' => '劇漫デラックス　','isbn' => '9784801918658'),
  array('name' => '劇漫デラックス　','isbn' => '9784801919365'),
  array('name' => '劇漫デラックス　','isbn' => '9784801920002'),
  array('name' => '劇漫デラックス　','isbn' => '9784801920613'),
  array('name' => '劇漫デラックス　','isbn' => '9784801921023'),
  array('name' => '劇漫デラックス　','isbn' => '9784801921603'),
  array('name' => '劇漫デラックス　','isbn' => '9784801922273'),
  array('name' => '劇漫デラックス　','isbn' => '9784801923171'),
  array('name' => '劇漫デラックス ','isbn' => '9784801923935'),
  array('name' => '劇漫デラックス ','isbn' => '9784801924840'),
  array('name' => '劇漫デラックス ','isbn' => '9784801925144'),
  array('name' => '劇漫デラックス ','isbn' => '9784801925991'),
  array('name' => '劇漫デラックス ','isbn' => '9784801926523'),
  array('name' => '劇漫デラックス ','isbn' => '9784801927322'),
  array('name' => '劇漫デラックス ','isbn' => '9784801928138'),
  array('name' => '劇漫デラックス ','isbn' => '9784801929043'),
  array('name' => '劇漫デラックス','isbn' => '9784801929555'),
  array('name' => '劇漫デラックス ','isbn' => '9784801930186'),
  array('name' => '劇漫デラックス ','isbn' => '9784801931381'),
  array('name' => '劇漫デラックス ','isbn' => '9784801932203'),
  array('name' => '劇漫デラックス ','isbn' => '9784801932531'),
  array('name' => '劇漫デラックス ','isbn' => '9784801933217'),
  array('name' => '劇漫デラックス ','isbn' => '9784801933934'),
  array('name' => '劇漫デラックス ','isbn' => '9784801934573'),
  array('name' => '劇漫デラックス ','isbn' => '9784801935327'),
  array('name' => '劇漫デラックス ','isbn' => '9784801936034'),
  array('name' => '劇漫デラックス ','isbn' => '9784801936829'),
  array('name' => '劇漫デラックス ','isbn' => '9784801937741'),
  array('name' => '劇漫デラックス ','isbn' => '9784801938335'),
  array('name' => 'ブラックご近所ＳＰ','isbn' => '9784801907744'),
  array('name' => 'ブラックご近所ＳＰ　','isbn' => '9784801910393'),
  array('name' => 'ブラックご近所ＳＰ','isbn' => '9784801914254'),
  array('name' => '女のブラック事件簿','isbn' => '9784801908642'),
  array('name' => '女のブラック事件簿　','isbn' => '9784801911284'),
  array('name' => '女のブラック事件簿　','isbn' => '9784801915206'),
  array('name' => '女のブラック事件簿　','isbn' => '9784801918269'),
  array('name' => '女の怖い病気ＳＰ','isbn' => '9784801909380'),
  array('name' => '女の怖い病気ＳＰ　','isbn' => '9784801913349'),
  array('name' => 'キレる女たち','isbn' => '9784801912021'),
  array('name' => '漫画人妻官能劇場','isbn' => '9784801914803'),
  array('name' => '漫画人妻官能劇場　','isbn' => '9784801915589'),
  array('name' => '漫画人妻官能劇場　','isbn' => '9784801917903'),
  array('name' => 'あなたの隣のモンスター主婦ＳＰ','isbn' => '9784801916241'),
  array('name' => '女のブラック履歴書','isbn' => '9784801917309'),
  array('name' => '女のブラック履歴書　','isbn' => '9784801921016'),
  array('name' => '女のブラック履歴書 ','isbn' => '9784801925137'),
  array('name' => '女のブラック履歴書 ','isbn' => '9784801929548'),
  array('name' => 'ｃｏｍｉｃギルティ～有罪～','isbn' => '9784801919358'),
  array('name' => 'ｃｏｍｉｃギルティ～有罪～','isbn' => '9784801920170'),
  array('name' => '女のブラック掲示板','isbn' => '9784801921719'),
  array('name' => '女のブラック掲示板 ','isbn' => '9784801926486'),
  array('name' => 'ブラック片付けＳＰ','isbn' => '9784801923164'),
  array('name' => 'ブラック人生SP','isbn' => '9784801924222'),
  array('name' => 'ブラック人生SP ','isbn' => '9784801927308'),
  array('name' => '女の心の闇','isbn' => '9784801928244'),
  array('name' => '五代目　三遊亭圓楽　名人名演集　','isbn' => '9784812441213'),
  array('name' => '五代目　三遊亭圓楽　名人名演集　','isbn' => '9784812441343'),
  array('name' => '五代目　三遊亭圓楽　名人名演集　','isbn' => '9784812441350'),
  array('name' => '北野誠のおまえら行くな。突撃！恐怖スペシャル','isbn' => '9784812490020'),
  array('name' => '住吉会総覧','isbn' => '9784812431016'),
  array('name' => '二代目弘道会総覧','isbn' => '9784812442036'),
  array('name' => '新制稲川会総覧','isbn' => '9784812442418'),
  array('name' => '六代目山口組　司忍組長','isbn' => '9784812445327'),
  array('name' => '動物のおしゃべり','isbn' => '9784801982420'),
  array('name' => 'リコーダーとランドセル','isbn' => '9784801982376'),
  array('name' => 'チート転生した猫は嫁の膝で丸くなりたい','isbn' => '9784801982536'),
  array('name' => '不遊美堂家の名にかけて!','isbn' => '9784801982369'),
  array('name' => '生まれ変わってもあなたの従者です','isbn' => '9784801982468'),
  array('name' => 'めぐみとつぐみ','isbn' => '9784801982437'),
  array('name' => 'ふたりあそび ','isbn' => '9784801982383'),
  array('name' => '人魚と王子とウソツキ悪魔','isbn' => '9784801982390'),
  array('name' => 'フロウフルレメディ','isbn' => '9784801982628'),
  array('name' => 'SYURIAN','isbn' => '9784801982529'),
  array('name' => 'TRIP LOVERS-対の手-','isbn' => '9784801982550'),
  array('name' => 'ぷち本当にあった愉快な話 鬼ヤバ!! 裏副業ーバイトーSP','isbn' => '9784801977259'),
  array('name' => 'ねこようかい きゅんっ','isbn' => '9784801982543'),
  array('name' => '借金大王は魔王を倒す!','isbn' => '9784801982611'),
  array('name' => '神童セフィリアの下剋上プログラム','isbn' => '9784801982406'),
  array('name' => '神童セフィリアの下剋上プログラム','isbn' => '9784801982413'),
  array('name' => '魔剣師の魔剣による魔剣のためのハーレムライフ','isbn' => '9784801982604'),
  array('name' => '魔法少女にあこがれて ','isbn' => '9784801982321'),
  array('name' => 'うちの会社の小さい先輩の話','isbn' => '9784801982475'),
  array('name' => '月花乙女は猛犬が好き','isbn' => '9784801982505'),
  array('name' => '魔王の娘たちとまぐわえば強くなれるって本当ですか?','isbn' => '9784801982451'),
  array('name' => '戦姫完食シンフォギア～調めし～','isbn' => '9784801982338'),
  array('name' => '銀輪ボイス','isbn' => '9784801982659'),
  array('name' => '今泉ん家はどうやらギャルの溜まり場になってるらしい～DEEP～','isbn' => '9784801982642'),
  array('name' => 'ここは鴨川ゲーム製作所','isbn' => '9784801982512'),
  array('name' => 'おサボり上手な小向井さんは俺を逃さない!! ','isbn' => '9784801982635'),
  array('name' => '公爵令嬢に転生してしまったので、メンタル乙女な俺は、全力で女の子を楽しみます ','isbn' => '9784801982314'),
  array('name' => 'クズ外道の俺は、洗脳スキルで美少女を脱がすことにした。','isbn' => '9784801982598'),
  array('name' => '虫の皇女マユの旅','isbn' => '9784801982482'),
  array('name' => '友達が私を理解らせにくるので勝利の女神の力を借りてこっちも理解らせにいきます。','isbn' => '9784801982499'),
  array('name' => '灼熱の卓球娘 REBURN!!','isbn' => '9784801982345'),
  array('name' => '灼熱の卓球娘 REBURN!!','isbn' => '9784801982352'),
  array('name' => 'むこうぶち','isbn' => '9784801982444'),
  array('name' => '劇漫デラックス','isbn' => '9784801939363'),
  array('name' => '本当にあった愉快な話 読者投稿プレミアム 2024冬号','isbn' => '9784801939059'),
  array('name' => '「エクソシスト」の遺産','isbn' => '9784801938533'),
  array('name' => '日本人傭兵の危険でおかしい戦場暮らし 戦時中の軍隊の真実編','isbn' => '9784801938427'),
  array('name' => '山口恵梨子(えりりん)の女流棋士の日々 将棋のお仕事出張編','isbn' => '9784801938885'),
  array('name' => '破天荒な妻に今日も振り回されています','isbn' => '9784801938410'),
  array('name' => 'さいお先生は今日も子どもに翻弄される～ベビーシッター4年目の絶望日記～','isbn' => '9784801938434'),
  array('name' => '溺愛花嫁 朝に濡れ夜に乱れ ','isbn' => '9784801938779'),
  array('name' => '溺愛花嫁 朝に濡れ夜に乱れ','isbn' => '9784801938786'),
  array('name' => '溺愛花嫁 朝に濡れ夜に乱れ','isbn' => '9784801938793'),
  array('name' => '発達障害が理解されにくいワケを自分で考えてみた','isbn' => '9784801938861'),
  array('name' => '親子で不登校になりました。','isbn' => '9784801938878'),
  array('name' => '進め!イラストレーターin無茶振りテレビ業界～24時間眠らない現場～','isbn' => '9784801938892'),
  array('name' => '異世界サウナでととのいセックス ～なにも知らない女冒険者にエッチなととのいを教え込む～','isbn' => '9784801938373'),
  array('name' => '川の怪談','isbn' => '9784801938854'),
  array('name' => 'レディ・ルーの秘密の手紙','isbn' => '9784801937994'),
  array('name' => 'ブリジャートン家短編集1 レディ・ホイッスルダウンの贈り物','isbn' => '9784801938915'),
  array('name' => '星なき王冠(クラウン) ','isbn' => '9784801938687'),
  array('name' => '星なき王冠(クラウン) ','isbn' => '9784801938694'),
  array('name' => '虐げられ令嬢ですが、なぜか女嫌いのエリート魔術師に溺愛されました','isbn' => '9784801938700'),
  array('name' => '前世処刑された転生令嬢はヤンデレ異母弟に偏愛される','isbn' => '9784801938717'),
  array('name' => '発育乳首～舌蜜教育～','isbn' => '9784801938519'),
  array('name' => '氷のヤクザ、異世界で白銀の闇王の治癒天使になる','isbn' => '9784801938526'),
  array('name' => '不倫手記 本能のまま滴り落ちる 女たちの愛欲のヌメり','isbn' => '9784801938731'),
  array('name' => '冷徹公爵は見知らぬ妻が可愛くて仕方がない 偽りの妻ですが旦那様に溺愛されています','isbn' => '9784801938755'),
  array('name' => '完璧なる子作り計画!? ハイスペック宰相閣下が「お前をお母さんにしてやろうか」と求婚してきました','isbn' => '9784801938762'),
  array('name' => '皇太子妃になりたくない!!薄幸フラグしかない悲劇の妃に転生したのでイケメン皇子に溺愛されつつ運命改変','isbn' => '9784801938397'),
  array('name' => 'モブ令嬢なので大丈夫……じゃなかった!?えっちな乙女ゲームに転生したら最推しエリートの公爵閣下に溺愛','isbn' => '9784801938403'),
  array('name' => '年下御曹司は白衣の花嫁と秘密の息子を今度こそ逃さない','isbn' => '9784801938359'),
  array('name' => '責め好き人妻のとりこ','isbn' => '9784801938342'),
  array('name' => 'とろめき村の淫ら合宿','isbn' => '9784801938380'),
  array('name' => 'ゆうわく女子寮','isbn' => '9784801938502'),
  array('name' => 'ハーレムは閉ざされた山荘に','isbn' => '9784801938670'),
  array('name' => '熟れ蜜の手ほどき','isbn' => '9784801938724'),
  array('name' => '店長は美人妻<新装版>','isbn' => '9784801939042'),
  array('name' => '「超」怖い話 辰','isbn' => '9784801938458'),
  array('name' => '怪奇異聞帖 地獄ねぐら','isbn' => '9784801938816'),
  array('name' => '屋敷怪談','isbn' => '9784801938465'),
  array('name' => '秋田怪談','isbn' => '9784801938472'),
  array('name' => '百怪語り 蛇神村の聲','isbn' => '9784801938489'),
  array('name' => '阪急沿線怪談','isbn' => '9784801938496'),
  array('name' => '現代異談 首塚の呪術師','isbn' => '9784801938823'),
  array('name' => '令和怪談集 恐の胎動','isbn' => '9784801938830'),
  array('name' => '魂消怪談 怪ノ目','isbn' => '9784801938847'),
  array('name' => 'らぶぱら 五芭','isbn' => '9784801938809'),
  array('name' => 'ただいま 希島あいり写真集','isbn' => '9784801938441'),
  array('name' => 'restart 小野六花写真集','isbn' => '9784801938748'),
  array('name' => '野球太郎No.050 プロ野球選手名鑑+ドラフト候補名鑑2024','isbn' => '9784801939370'),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃11男と女のデスゲーム　上巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃11男と女のデスゲーム　中巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃11男と女のデスゲーム　下巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃12打倒最強位　上巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃12打倒最強位　中巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃12打倒最強位　下巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃13全日本プロ選手権　上巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃13全日本プロ選手権　中巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃13全日本プロ選手権　下巻','isbn' => ''),
  array('name' => 'ＤＶＤ　麻雀最強戦２０２３　＃14全国アマチュア最強位決定戦　決勝戦','isbn' => ''),
  array('name' => '麗しの城主様～恋の宮廷騒乱記～　ＤＶＤーＢＯＸ','isbn' => ''),
  array('name' => 'ラブ・ドクター　秘密の結婚生活は前途多難！？　ＤＶＤーＢＯＸ','isbn' => ''),
  array('name' => 'ラブ・ドクター　秘密の結婚生活は前途多難！？　ＤＶＤーＢＯＸ','isbn' => ''),
  array('name' => '星花双姫～天に咲き、地に輝く恋～　ＤＶＤーＢＯＸ','isbn' => ''),
  array('name' => 'ＤＶＤ　席亭・北野誠の圓山町怪談亭～怪談独演　夜馬裕～','isbn' => ''),
  array('name' => 'ＤＶＤ　比留川マイ　舞姫','isbn' => '9784801938939'),
  array('name' => 'ＤＶＤ　佐々木萌香　もえかと密着恋愛','isbn' => '9784801939394'),
  array('name' => 'ＤＶＤ　朝野ナツ　弾むなっちゃん','isbn' => '9784801938922'),
  array('name' => 'ＤＶＤ　篠見星奈　恒星くらい輝いて','isbn' => '9784801939417'),
  array('name' => 'ＤＶＤ　姫野みなみ　彼女の名は清純','isbn' => '9784801938946'),
  array('name' => 'ＤＶＤ　能美真奈　お餅がライバル！','isbn' => '9784801938953'),
  array('name' => 'ＤＶＤ　永瀬永茉　いいこになったよ？','isbn' => '9784801938960'),
  array('name' => 'ＤＶＤ　白浜さち　甘美な吐息','isbn' => '9784801938977'),
  array('name' => 'ＤＶＤ　乃木結夢　小悪魔ユナ','isbn' => '9784801938984'),
  array('name' => 'ＤＶＤ　かやのりお　りおじゃないと','isbn' => '9784801938991'),
  array('name' => 'ＤＶＤ　ミルキー・グラマー　福永まや','isbn' => '9784801939004'),
  array('name' => 'ＤＶＤ　空峰凛　研究員のお姉さんを研究したい','isbn' => '9784801939011'),
  array('name' => 'ＤＶＤ　ＲＵＲＵ　台湾生まれの１０１ｃｍ','isbn' => '9784801939028'),
  array('name' => 'ＤＶＤ　えりれろ　妄想恋愛','isbn' => '9784801939035'),
  array('name' => 'ＤＶＤ　村上りいな　りいなとしたいこと','isbn' => '9784801939400'),
  array('name' => 'ＤＶＤ　ミルキー・グラマー　花咲楓香','isbn' => '9784801939424'),
  array('name' => 'ＤＶＤ　宇美野ちの　君のちの','isbn' => '9784801939431'),
  array('name' => 'ＤＶＤ　ミルキー・グラマー　藤川めい','isbn' => '9784801939448'),
  array('name' => 'ＤＶＤ　吉瀬結　あなたと結ばれたい','isbn' => '9784801939455'),
  array('name' => 'ＤＶＤ　美森ふう　ふうふうして','isbn' => '9784801939462'),
);

$debug = true;
$publisher_id = 1125; // 竹書房 本番

if($debug) {
  // STG用
  $dsn = 'pgsql:dbname=d32hupuj29g33c;host=ec2-44-206-11-200.compute-1.amazonaws.com;port=5432';
  $db = new PDO($dsn, 'rszgmnfrbqlgot', '237cbd5e1db3db80228bbf1483cd208c850e4d22bfd12c85b7e317b1cc569700');
} else {
  // 本番用
  $dsn = 'pgsql:dbname=d3uldjpkj3ctch;host=ec2-34-233-148-141.compute-1.amazonaws.com;port=5432';
  $db = new PDO($dsn, 'u43nqlr506q4qg', 'pd20127aa81443c772b163cc2eb6c9960b8735bb9a29528e868c86af98c8ed8ed');
}


ob_start();

$i = 0;
foreach ($list as $k => $v) {
  $sql = "";
  if(!empty($v['isbn'])) {
    $sql = "select id,name,isbn,publisher_id from books where isbn = '{$v['isbn']}' and publisher_id = {$publisher_id};";
  } else {
    $sql = "select id,name,isbn,publisher_id from books where name = '{$v['name']}' and publisher_id = {$publisher_id};";
  }
  foreach ($db->query($sql) as $row) {
    echo $row['isbn'];
    echo "||"; // 後で置換用の区切り文字
    echo $row['id'];
    echo "||"; // 後で置換用の区切り文字
    echo $row['name'];
    echo "||"; // 後で置換用の区切り文字
  }

  echo "<br>";
  $i++;
  if($i > 20) {
    // 20回まわったら ページ出力
    flush();
    ob_flush();
    $i = 0;
  }
}
flush();
ob_flush();

ob_end_flush();

echo "end!!";
exit();
